{"rooms":[{"name":"Catwoman","id":"ROOM66"},{"name":"School for the gifted","id":"ROOM69"},{"name":"Spiderman","id":"ROOM64"},{"name":"Thor","id":"ROOM65"}],"sessions":[{"photoUrl":"http://www.devfest.nl/img/speakers/AdolfoBenedetti.jpg","color":"#ffba02","speakers":["9964","9963"],"description":"During the workshop we will work with Material design's responsive features​ available for Polymer, paper widgets, ink effects, and more. Also learn about Polymer's data-binding features and callbacks​, core components, Vulcanize and WebComponents.​\r\n\r\n- Getting set up (This workshop uses Chrome Dev Editor).\r\n- Installing core element​​s\r\n- Building a responsive layout​​\r\n- Opening a drawer\r\n- Using Paper elements\r\n- Storing locally\r\n- Using control elements\r\n- Adding Paper effects\r\n- Using Vulcanize\r\n\r\nPrerequisites:\r\n- Bower\r\n- Grunt\r\n- Chrome Browser\r\n- Basic understanding of HTML, CSS, and web development\r\n- Understanding of JavaScript prototypes\r\n\r\n\r\nMore information can be found on <a href='http://itshackademic.com'>It's Hackademic<\/a>","id":"10001","isLivestream":false,"title":"Polymer Polytechnic","endTimestamp":"2014-11-08T11:30:00Z","url":"","startTimestamp":"2014-11-08T09:30:00Z","room":"ROOM69","tags":["TYPE_SESSION","THEME_1190"]},{"photoUrl":"http://www.devfest.nl/img/speakers/ArtemGolovin.jpg","color":"#e81d62","speakers":["9970"],"description":"This session is about tricks, pitfalls and best practises in AngularJS in a few different fields such as debugging techniques, backend communication, code organisation and avoiding bad practices. This session is organized as a live coding session to show all the points in practical ways (and on a real working application). It will end up with a useful questions-answers part where everyone can ask a question about building their own AngularJS application.","id":"10006","isLivestream":false,"title":"AngularJS best practices and experiences","endTimestamp":"2014-11-08T10:10:00Z","url":"","startTimestamp":"2014-11-08T09:30:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1188"]},{"photoUrl":"http://www.devfest.nl/img/speakers/MattFeigal.jpg","color":"#A4C639","speakers":["9946"],"description":"This is a live coding demo, adding an AppEngine backend to an existing Android Application. Highlights developer productivity features such as Cloud Endpoints to create both REST APIs on top of your backend, auto-generated native libraries for easy communicate between your Android app and Backend, and Gradle integration with Android Studio and CloudPlatform.","id":"9997","isLivestream":false,"title":"Building Cloud Powered Mobile Applications","endTimestamp":"2014-11-08T10:10:00Z","url":"","startTimestamp":"2014-11-08T09:30:00Z","room":"ROOM66","tags":["TYPE_SESSION","THEME_1186"]},{"photoUrl":"http://www.devfest.nl/img/speakers/ErnestMicklei.jpg","color":"#4285f4","speakers":["9961"],"description":"Go is a relatively young language but has great potential as a cross-platform, general purpose language to build high performance network services, text processing engines and infrastructure tools (e.g. Docker). It has been getting a lot of attention since cloud companies are started to rely their business on it; Google being one of them.\r\n\r\nThis talk will introduce Go to developers with a Java background. With a collection of common problems, example solutions are discussed using the Go language. Finally, some code examples are given for which the Java counterpart would be more verbose and in some cases a lot more complex.","id":"9999","isLivestream":false,"title":"Go for Java developers","endTimestamp":"2014-11-08T10:10:00Z","url":"","startTimestamp":"2014-11-08T09:30:00Z","room":"ROOM65","tags":["TYPE_SESSION","THEME_1189"]},{"photoUrl":"http://www.devfest.nl/img/speakers/WolframRittmeyer.jpg","color":"#A4C639","speakers":["10102"],"description":"In this talk I'm going to introduce the changes around notifications in Android L.\r\n\r\nThose changes start with a new design of notifications. Though some of those come automagically, you have to add information for other parts to get the best results.\r\nAnother change coming is the ability to present notifications on the lock screen. Obviously not everything should be visible there. Let's see how to keep private stuff private while still making use of this feature.\r\nAnd finally there's the new ability to get the users immediate attention by using the new 'Heads-on notifications'\r\n\r\nAll this is guided by my firm believe that notifications should inform users but not annoy them!","id":"10106","isLivestream":false,"title":"Android Notifications","endTimestamp":"2014-11-08T11:00:00Z","url":"","startTimestamp":"2014-11-08T10:20:00Z","room":"ROOM66","tags":["TYPE_SESSION","THEME_1186"]},{"photoUrl":"http://www.devfest.nl/img/speakers/CarmenPopoviciu.jpg","color":"#e81d62","speakers":["9965"],"description":"Web components are an awesome new set of standards, that pave the way we think and build the web applications of the future.\r\n\r\nIn this talk I would like to go over the basics of these standards and provide a better understanding of what they are, what makes them so great and how we can use them.","id":"10002","isLivestream":false,"title":"Introduction to web components","endTimestamp":"2014-11-08T11:00:00Z","url":"","startTimestamp":"2014-11-08T10:20:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1188"]},{"photoUrl":"http://www.devfest.nl/img/speakers/SorenGjesse.jpg","color":"#4285f4","speakers":["9960"],"description":"Dart is a modern optionally typed language. It is best known for modern client-side web apps, but it has a compelling server-side story, too.\r\n\r\nDart's server-side framework has been developed from scratch and offers a scalable IO API with a unified asynchronous programming model. It is exactly what you expect from a modern framework: it is simple, fast, and easy to work with. Despite its simplicity its provides excellent performance, frequently outperforming other well-known frameworks. With the upcoming support for “async await” in Dart writing asynchronous code becomes much simpler.\r\nDart runs on Google App Engine, has wide support for Google Services and is easy to deploy in a Docker container. This is all part of making Dart a great experience server-side.\r\n\r\nMain topics of this talk:\r\n- Structure of a Dart server application\r\n- Benefits of having the same language on both client and server\r\n- Why an async programming mode is a perfect fit for I/O\r\n- Scaling I/O in Dart using multiple threads\r\n- How to handle shared data in the Dart programming model\r\n- Accessing Google APIs from Dart\r\n- Running Dart on Google App Engine\r\n- Deploying a Dart application in a Docker container\r\n","id":"9998","isLivestream":false,"title":"Using Dart in the Cloud","endTimestamp":"2014-11-08T11:00:00Z","url":"","startTimestamp":"2014-11-08T10:20:00Z","room":"ROOM65","tags":["TYPE_SESSION","THEME_1189"]},{"photoUrl":"http://www.devfest.nl/img/speakers/HugoVisser.jpg","color":"#ffba02","speakers":["9972","9973"],"description":"In this workshop, we'll get our hands dirty with the Android Wear SDK. No doubt that you've seen the LG G Watch, Samsung Gear Live and Motorola Moto 360, so surely you're excited to play with them! Dive into creating an Android Wear app, and learn how you can adapt your app to appear on these cool new devices!\r\n\r\nPlease note: it's required that you bring your own Android device running Android 4.3 or higher. Not sure if your device supports Android Wear? Check: http://g.co/WearCheck on your device to find out. \r\n\r\nIf you cannot bring an Android Wear compatible device, check with a buddy that you can team up using his or hers. Some experience with Android is required. If you're familiar with setting up a project in Android Studio and building an app with notifications, you're ready to start working with Android Wear. Please install the latest Android SDK tools, platform-tools, build-tools and Android 4.4W (API 20) SDK at home, to avoid download-mania on-site!\r\n\r\nDuring the course of this workshop we will make sure that there are plenty Android Wear devices available on site to develop and test with.\r\n\r\nThis is a guided workshop with prearranged material. Experienced Android developers are present to help you with the exercises or answer any questions you might have.","id":"10008","isLivestream":false,"title":"Android Wear","endTimestamp":"2014-11-08T14:00:00Z","url":"","startTimestamp":"2014-11-08T12:00:00Z","room":"ROOM69","tags":["TYPE_SESSION","THEME_1190"]},{"photoUrl":"http://www.devfest.nl/img/speakers/MandyWaite.jpg","color":"#4285f4","speakers":["9974"],"description":"Everyone is talking about Containers, but mostly in the context of how they work and not why and when they are useful or how to apply them to your own often complex and unique Use Cases. We'll look at how Google Cloud Platform enables developers when it comes to building Cloud Native applications and we'll show how support for containers fits into the big picture and provide insight into the when, why and how of using them. \r\n\r\nWe'll wrap up with a cool demo of the Kubernetes Container Scheduler.","id":"10072","isLivestream":false,"title":"A Developers Guide to Containers in the Cloud","endTimestamp":"2014-11-08T12:40:00Z","url":"","startTimestamp":"2014-11-08T12:00:00Z","room":"ROOM65","tags":["TYPE_SESSION","THEME_1189"]},{"photoUrl":"http://www.devfest.nl/img/speakers/MischaDasberg.jpg","color":"#e81d62","speakers":["9967","9968"],"description":"Every developer tends to reinvent the wheel over and over and over and over again. How do you prevent multiple implementations of the same functionality? How do you guarantee a uniform user experience (UX) across hundreds of pages and lots of different small web applications and 300 developers.\r\n\r\nIn this talk we will address our experiences in moving the biggest online banking website in the Netherlands from a traditional JSP based web application towards a SPA using AngularJS.\r\n\r\nWe will demonstrate how and why we have build a component library and style guide. On top of that we have build a documentation application which:\r\n- Allows the UX-designer to rapidly make prototypes\r\n- Forces UX-designers to think of the big picture\r\n- Allows the developers to use ready made components and markup straight from UX\r\n- Tries to bridges the gap between outrages UX designs and technical limitations\r\n\r\nTopics that will be addressed in this talk:\r\n- Building and testing shared UX components with <i>AngularJS<\/i>, <i>Karma<\/i> and <i>Protractor<\/i>\r\n- Testing shared CSS library components and markup with <b>Galen<\/b>\r\n- Demonstrate changeability of look and feel in live applications\r\n- Using <b>PageObjects<\/b> to minimize impact","id":"10004","isLivestream":false,"title":"Enterprise scale AngularJS: Component library and Style guide","endTimestamp":"2014-11-08T12:40:00Z","url":"","startTimestamp":"2014-11-08T12:00:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1188"]},{"photoUrl":"http://www.devfest.nl/img/speakers/EricLafortune.jpg","color":"#A4C639","speakers":["9935"],"description":"Apps are getting larger, pushed by ever increasing user expectations. Social media, maps, advertisements,... As a developer, you may add a few libraries, and before you know it, your app is exceeding the constraints of the Android platform. In this presentation, I will discuss the main problems and some solutions. ProGuard, the bytecode optimizer and obfuscator in the Android SDK, is an obvious first step. I will show some optimized configurations that can help you to reduce the size of common libraries. If ProGuard isn't sufficient, you may have to resort to more drastic techniques, such as dynamic class loading. I'll discuss some techniques and their implications. I'll also introduce the new dex splitting feature of our software DexGuard.","id":"9950","isLivestream":false,"title":"Fighting application size with ProGuard and beyond","endTimestamp":"2014-11-08T12:40:00Z","url":"","startTimestamp":"2014-11-08T12:00:00Z","room":"ROOM66","tags":["TYPE_SESSION","THEME_1186"]},{"photoUrl":"http://www.devfest.nl/img/speakers/MaartenVerbaarschot.jpg","color":"#e81d62","speakers":["10105"],"description":"Angular has influenced the way I work, a lot. During this talk, I will explain how I leverage Angular to componentize a frontend architecture. I will show you how working with components helps with automated testing (unit, e2e), and how it is also very suitable for rapid prototyping.\r\n\r\nWe'll also look at some changes that have happened in Angular over the past year (and why), changes that are going to happen with Angular 2.0, and how we can take inspiration from these to further improve our own architecture.\r\n\r\nThis session is aimed both at people who have no Angular experience yet and at those who have. I'll cover various features that Angular has to offer, but also throw in a lot of opinion and share some lessons that I have learned over the past few years.","id":"18806","isLivestream":false,"title":"Designing Angular Components","endTimestamp":"2014-11-08T13:30:00Z","url":"","startTimestamp":"2014-11-08T12:50:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1188"]},{"photoUrl":"http://www.devfest.nl/img/speakers/KarsVeling.jpg","color":"#4285f4","speakers":["10104"],"description":"In this hands-on session we'll dive into GCE (Google Compute Engine), the overall technical architecture, how Q42 uses GCE in their commercial projects and how GCE differs from platforms like Amazon.\r\n\r\nAfter a snappy tech tour on GCE we will live-code a Nodejs and Elastic Search cluster on GCE and show how you do that, how it runs and how you can move forward on that, how to scale and manage it on GCE.\r\n\r\nThis session is interesting for people who want to know more or use GCE in their projects, who wants to know more about GCE architecture or who already use GCE and want to move forward with Elastic Search or Nodejs on GCE.\r\n","id":"10114","isLivestream":false,"title":"Hands On Compute Engine - NodeJs and ElasticSearch","endTimestamp":"2014-11-08T13:30:00Z","url":"","startTimestamp":"2014-11-08T12:50:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1189"]},{"photoUrl":"http://www.devfest.nl/img/speakers/PeterVerhage.jpg","color":"#4285f4","speakers":["9966"],"description":"Recently we built an open source Google Glass authentication application together with SURFnet, which allows a user to login to websites and/or other properties using just the Google Glass. The Glass stores the user's digital identity, and the user simply logs in by using the Glass to look at the login screen of a website (scanning a QR code on the screen).\r\n\r\nIn this talk I will not just demo the application and show an innovative way to use Google Glass, but will also talk about the challenges we faced bringing this app to Google Glass, so it's a playful introduction into developing apps for Google Glass.","id":"10003","isLivestream":false,"title":"Using Google Glass for Secure Access Control","endTimestamp":"2014-11-08T13:30:00Z","url":"","startTimestamp":"2014-11-08T12:50:00Z","room":"ROOM65","tags":["TYPE_SESSION","THEME_1189"]},{"photoUrl":"http://www.devfest.nl/img/speakers/FrankSchroeder.jpg","color":"#4285f4","speakers":["9969"],"description":"Marktplaats is running on a micro-services architecture written mainly in Java & Scala using continuous development and deployment. Admarkt (Marktplaats' pay per click advertisement system) is built on the same technology stack was hitting scalability limits on all levels.\r\n\r\nIn this presentation I'm going to explain how I changed the development process to become more productive and what effect the introduction of Go had on the team. Go helped us tackle dependency management and compile time issues. All new services are written in Go. Scala & Java services are rewritten in Go. Team members are advocating Go.\r\n\r\nI will layout the methodology and toolbox we're using, how small and how big we've scaled with Go. While the rest of the company is moving forward with Scala we remain an island but I'm convinced that time is on our side.","id":"10005","isLivestream":false,"title":"1 year of Go @ eBay / Marktplaats","endTimestamp":"2014-11-08T15:00:00Z","url":"","startTimestamp":"2014-11-08T14:20:00Z","room":"ROOM65","tags":["TYPE_SESSION","THEME_1189"]},{"photoUrl":"http://www.devfest.nl/img/speakers/MartinNaumann.jpg","color":"#e81d62","speakers":["9975"],"description":"Build engaging experiences using Google Chromecast by leveraging the power of the web that Chromecast brings to your TV. This session shows how to use the Chromecast SDKs to build cross-platform multiplayer games for the living room. It covers the Chromecast Javascript SDK, Websockets and more.","id":"10011","isLivestream":false,"title":"Multiplayer games with Chromecast","endTimestamp":"2014-11-08T15:00:00Z","url":"","startTimestamp":"2014-11-08T14:20:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1188"]},{"photoUrl":"http://www.devfest.nl/img/speakers/IoannisPanagiotopoulos.jpg","color":"#A4C639","speakers":["9971"],"description":"Last year Google introduced a new build system for Android apps: Gradle, replacing Ant. Gradle is more powerful and much better documented. I will explain how to use the Android plugin for Gradle. Based on examples we will explore some of the powers of Gradle and how to improve your project setup resulting in better quality and more convenience.","id":"10007","isLivestream":false,"title":"Using Gradle for Android","endTimestamp":"2014-11-08T15:00:00Z","url":"","startTimestamp":"2014-11-08T14:20:00Z","room":"ROOM66","tags":["TYPE_SESSION","THEME_1186"]},{"photoUrl":"http://www.devfest.nl/img/speakers/RonaldVanDerLingen.jpg","color":"#A4C639","speakers":["9962"],"description":"In 2010, Google launched Google TV. A first attempt to bring Android to the TV. While there were several devices released, it was not really successful and supported by the industry. At Google I/O 2014 we saw the announcement of Android TV as part of the multi-screen strategy that comes with the Android L release. A new name, a different approach, a true second attempt to conquer the living room.\r\n\r\nIn this talk, I will cover the differences between Google TV and Android TV, both from a UX and developer perspective. I will explain the steps required to make your apps ready for Google TV. An ADT-1 device will be available for a live demonstration.","id":"10000","isLivestream":false,"title":"Android TV - Google's second attempt to conquer the living room","endTimestamp":"2014-11-08T15:50:00Z","url":"","startTimestamp":"2014-11-08T15:10:00Z","room":"ROOM64","tags":["TYPE_SESSION","THEME_1186"]},{"photoUrl":"http://www.devfest.nl/img/speakers/JozuaSijsling.jpg","color":"#A4C639","speakers":["10113"],"description":"One of the main features Google broadcasted when they announced Android was that you could share data between apps. Fast forward a few years and we find that apps that expose their data are very rare. But even if your app doesn't expose data, there are still good reasons to use a content provider.","id":"10115","isLivestream":false,"title":"Content Providers","endTimestamp":"2014-11-08T15:50:00Z","url":"","startTimestamp":"2014-11-08T15:10:00Z","room":"ROOM66","tags":["TYPE_SESSION","THEME_1186"]},{"photoUrl":"http://www.devfest.nl/img/speakers/fireplace.png","color":"#4285f4","speakers":["18797"],"description":"In this informal session we would like to sit by the virtual fireplace and give you the possibility to ask any question to various speakers on the fireside panel. If we are just staring at each other the moderator will put an extra woodblock on the fire by posing a taunting statement with the intention to heat up the discussion to a passionate debate.","id":"18800","isLivestream":false,"title":"Fireside Chat","endTimestamp":"2014-11-08T15:50:00Z","url":"","startTimestamp":"2014-11-08T15:10:00Z","room":"ROOM65","tags":["TYPE_SESSION","THEME_1189"]}],"hashtags":[{"color":"#311b92","name":"#Aandroid","description":"","order":1},{"color":"#01579b","name":"#Aangularjs","description":"","order":2},{"color":"#0d5302","name":"#Aapplication","description":"","order":3},{"color":"#e65100","name":"#Aapplications","description":"","order":4},{"color":"#212121","name":"#Cchromecast","description":"","order":5},{"color":"#880e4f","name":"#Ccloud","description":"","order":6},{"color":"#1a237e","name":"#Ccomponents","description":"","order":7},{"color":"#006064","name":"#Ccontainers","description":"","order":8},{"color":"#33691e","name":"#Ddevelopers","description":"","order":9},{"color":"#bf360c","name":"#Eelasticsearch","description":"","order":10},{"color":"#263238","name":"#Eenterprise","description":"","order":11},{"color":"#4a148c","name":"#Eexperiences","description":"","order":12},{"color":"#2a36b1","name":"#Gguide","description":"","order":13},{"color":"#004d40","name":"#Iintroduction","description":"","order":14},{"color":"#827717","name":"#Mmarktplaats","description":"","order":15},{"color":"#3e2723","name":"#Mmultiplayer","description":"","order":16},{"color":"#b0120a","name":"#Nnotifications","description":"","order":17},{"color":"#311b92","name":"#Ppolytechnic","description":"","order":18},{"color":"#01579b","name":"#Pproviders","description":"","order":19},{"color":"#0d5302","name":"#Uusing","description":"","order":20}],"partners":[],"blocks":[{"start":"2014-11-08T08:30:00.000Z","end":"2014-11-08T09:00:00.000Z","title":"Doors open","type":"break"},{"start":"2014-11-08T09:00:00.000Z","end":"2014-11-08T09:20:00.000Z","title":"Opening","type":"break"},{"start":"2014-11-08T09:30:00.000Z","end":"2014-11-08T11:30:00.000Z","title":"","type":"free"},{"start":"2014-11-08T09:30:00.000Z","end":"2014-11-08T10:10:00.000Z","title":"","type":"free"},{"start":"2014-11-08T10:20:00.000Z","end":"2014-11-08T11:00:00.000Z","title":"","type":"free"},{"start":"2014-11-08T11:00:00.000Z","end":"2014-11-08T12:00:00.000Z","title":"Lunch","type":"break"},{"start":"2014-11-08T12:00:00.000Z","end":"2014-11-08T14:00:00.000Z","title":"","type":"free"},{"start":"2014-11-08T12:00:00.000Z","end":"2014-11-08T12:40:00.000Z","title":"","type":"free"},{"start":"2014-11-08T12:50:00.000Z","end":"2014-11-08T13:30:00.000Z","title":"","type":"free"},{"start":"2014-11-08T13:30:00.000Z","end":"2014-11-08T14:20:00.000Z","title":"Coffee break","type":"break"},{"start":"2014-11-08T14:20:00.000Z","end":"2014-11-08T15:00:00.000Z","title":"","type":"free"},{"start":"2014-11-08T15:10:00.000Z","end":"2014-11-08T15:50:00.000Z","title":"","type":"free"},{"start":"2014-11-08T16:00:00.000Z","end":"2014-11-08T18:00:00.000Z","title":"After Party","type":"break"}],"speakers":[{"name":"Adolfo Benedetti","bio":"Software Engineer","id":"9964","thumbnailUrl":"http://www.devfest.nl/img/speakers/AdolfoBenedetti.jpg"},{"name":"Artem Golovin","bio":"Front-end Developer","id":"9970","thumbnailUrl":"http://www.devfest.nl/img/speakers/ArtemGolovin.jpg"},{"name":"Carmen Popoviciu","bio":"Front-end engineer","id":"9965","thumbnailUrl":"http://www.devfest.nl/img/speakers/CarmenPopoviciu.jpg"},{"name":"Dennis Geurts","bio":"Software Architect and co-organizer of the DutchAUG","id":"9963","thumbnailUrl":"http://www.devfest.nl/img/speakers/DennisGeurts.png"},{"name":"DevFest Speaker Panel","bio":"","id":"18797","thumbnailUrl":"http://www.devfest.nl/img/speakers/fireplace.png"},{"name":"Eric Lafortune","bio":"Creator of Proguard and Dexguard","id":"9935","thumbnailUrl":"http://www.devfest.nl/img/speakers/EricLafortune.jpg"},{"name":"Ernest Micklei","bio":"Senior Software Architect","id":"9961","thumbnailUrl":"http://www.devfest.nl/img/speakers/ErnestMicklei.jpg"},{"name":"Frank Schr&ouml;der","bio":"Lead Developer / Team Lead B2C Admarkt","id":"9969","thumbnailUrl":"http://www.devfest.nl/img/speakers/FrankSchroeder.jpg"},{"name":"Hugo Visser","bio":"Android Developer, owner of Little Robots","id":"9972","thumbnailUrl":"http://www.devfest.nl/img/speakers/HugoVisser.jpg"},{"name":"Ioannis Panagiotopoulos","bio":"Tech Lead Android Development at IceMobile","id":"9971","thumbnailUrl":"http://www.devfest.nl/img/speakers/IoannisPanagiotopoulos.jpg"},{"name":"Jozua Sijsling","bio":"Freelance software engineer","id":"10113","thumbnailUrl":"http://www.devfest.nl/img/speakers/JozuaSijsling.jpg"},{"name":"Kars Veling","bio":"Google Developer Expert, founder of Q42","id":"10104","thumbnailUrl":"http://www.devfest.nl/img/speakers/KarsVeling.jpg"},{"name":"Maarten Verbaarschot","bio":"Front-end Developer at De Voorhoede","id":"10105","thumbnailUrl":"http://www.devfest.nl/img/speakers/MaartenVerbaarschot.jpg"},{"name":"Mandy Waite","bio":"Developer Advocate for Google Cloud Platform","id":"9974","thumbnailUrl":"http://www.devfest.nl/img/speakers/MandyWaite.jpg"},{"name":"Martin Naumann","bio":"Software Engineer at Archilogic","id":"9975","thumbnailUrl":"http://www.devfest.nl/img/speakers/MartinNaumann.jpg"},{"name":"Matthew Feigal","bio":"Cloud Platform Solution Architect","id":"9946","thumbnailUrl":"http://www.devfest.nl/img/speakers/MattFeigal.jpg"},{"name":"Mischa Dasberg","bio":"Software Architect at JPoint","id":"9967","thumbnailUrl":"http://www.devfest.nl/img/speakers/MischaDasberg.jpg"},{"name":"Paul Lammertsma","bio":"Android Developer at Pixplicity","id":"9973","thumbnailUrl":"http://www.devfest.nl/img/speakers/PaulLammertsma.jpg"},{"name":"Peter Verhage","bio":"All-round developer / CTO / Co-founder Egeniq","id":"9966","thumbnailUrl":"http://www.devfest.nl/img/speakers/PeterVerhage.jpg"},{"name":"Remco Vlierman","bio":"Freelance Web Developer","id":"9968","thumbnailUrl":"http://www.devfest.nl/img/speakers/RemcoVlierman.jpg"},{"name":"Ronald van der Lingen","bio":"Research & Development Lead","id":"9962","thumbnailUrl":"http://www.devfest.nl/img/speakers/RonaldVanDerLingen.jpg"},{"name":"Søren Gjesse","bio":"Software Engineer on the Dart team","id":"9960","thumbnailUrl":"http://www.devfest.nl/img/speakers/SorenGjesse.jpg"},{"name":"Wolfram Rittmeyer","bio":"Software Engineer, owner of Open Minds","id":"10102","thumbnailUrl":"http://www.devfest.nl/img/speakers/WolframRittmeyer.jpg"}],"videos":[],"experts":[{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/AdolfoBenedetti.jpg","name":"Adolfo Benedetti","bio":"Software Engineer","id":"9964","url":"https://plus.google.com/+AdolfoBenedetti"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/ArtemGolovin.jpg","name":"Artem Golovin","bio":"Front-end Developer","id":"9970","url":"https://plus.google.com/+ArtemGolovin"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/CarmenPopoviciu.jpg","name":"Carmen Popoviciu","bio":"Front-end engineer","id":"9965","url":"https://plus.google.com/118143942632321563925"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/DennisGeurts.png","name":"Dennis Geurts","bio":"Software Architect and co-organizer of the DutchAUG","id":"9963","url":"https://plus.google.com/108236118232381198098"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/fireplace.png","name":"DevFest Speaker Panel","bio":"","id":"18797","url":""},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/EricLafortune.jpg","name":"Eric Lafortune","bio":"Creator of Proguard and Dexguard","id":"9935","url":"https://www.linkedin.com/profile/view?id=212154664"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/ErnestMicklei.jpg","name":"Ernest Micklei","bio":"Senior Software Architect","id":"9961","url":"https://plus.google.com/+ErnestMicklei"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/FrankSchroeder.jpg","name":"Frank Schr&ouml;der","bio":"Lead Developer / Team Lead B2C Admarkt","id":"9969","url":"https://plus.google.com/107945180404729331757"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/HugoVisser.jpg","name":"Hugo Visser","bio":"Android Developer, owner of Little Robots","id":"9972","url":"https://plus.google.com/+HugoVisser"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/IoannisPanagiotopoulos.jpg","name":"Ioannis Panagiotopoulos","bio":"Tech Lead Android Development at IceMobile","id":"9971","url":"https://plus.google.com/+IoannisPanagiotopoulos"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/JozuaSijsling.jpg","name":"Jozua Sijsling","bio":"Freelance software engineer","id":"10113","url":"https://plus.google.com/+JozuaSijsling"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/KarsVeling.jpg","name":"Kars Veling","bio":"Google Developer Expert, founder of Q42","id":"10104","url":"https://plus.google.com/+KarsVeling"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/MaartenVerbaarschot.jpg","name":"Maarten Verbaarschot","bio":"Front-end Developer at De Voorhoede","id":"10105","url":"https://plus.google.com/117898593926559748909"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/MandyWaite.jpg","name":"Mandy Waite","bio":"Developer Advocate for Google Cloud Platform","id":"9974","url":"https://google.com/+MandyWaite"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/MartinNaumann.jpg","name":"Martin Naumann","bio":"Software Engineer at Archilogic","id":"9975","url":"https://www.google.com/+MartinN1"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/MattFeigal.jpg","name":"Matthew Feigal","bio":"Cloud Platform Solution Architect","id":"9946","url":"https://plus.google.com/+MatthewFeigal"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/MischaDasberg.jpg","name":"Mischa Dasberg","bio":"Software Architect at JPoint","id":"9967","url":"https://plus.google.com/111302754471583092322"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/PaulLammertsma.jpg","name":"Paul Lammertsma","bio":"Android Developer at Pixplicity","id":"9973","url":"https://plus.google.com/+PaulLammertsma"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/PeterVerhage.jpg","name":"Peter Verhage","bio":"All-round developer / CTO / Co-founder Egeniq","id":"9966","url":"https://twitter.com/petercv"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/RemcoVlierman.jpg","name":"Remco Vlierman","bio":"Freelance Web Developer","id":"9968","url":"https://www.linkedin.com/profile/view?id=6663768"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/RonaldVanDerLingen.jpg","name":"Ronald van der Lingen","bio":"Research & Development Lead","id":"9962","url":"https://plus.google.com/+RonaldVanDerLingen"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/SorenGjesse.jpg","name":"Søren Gjesse","bio":"Software Engineer on the Dart team","id":"9960","url":"http://dartlang.org/"},{"attending":true,"imageUrl":"http://www.devfest.nl/img/speakers/WolframRittmeyer.jpg","name":"Wolfram Rittmeyer","bio":"Software Engineer, owner of Open Minds","id":"10102","url":"https://plus.google.com/+WolframRittmeyer"}],"tags":[{"name":"Cloud & Other","tag":"THEME_1189","abstract":"","category":"THEME","order_in_category":1},{"name":"Mobile","tag":"THEME_1186","abstract":"","category":"THEME","order_in_category":2},{"name":"Web","tag":"THEME_1188","abstract":"","category":"THEME","order_in_category":3},{"name":"Workshop","tag":"THEME_1190","abstract":"","category":"THEME","order_in_category":4}]}